{
  "projects": [
    {
      "title": "Ask Tatiana",
      "description": "A simple app utilizing OpenAI's completion API to generate responses. Pre-prompting is used to solicit sage wisdom and comforting advice tailored to the user's entries. This app is hosted on Vercel's serverless hosting platform and uses Redis to limit the number requests originating from a single IP.",
      "tech": "Next.js, Node.js, React, Redis, HTML, TailwindCSS",
      "imagepath": "/images/projects/ask_tatiana.jpg",
      "source": "https://github.com/wesleyvankomen/AskTatiana",
      "url": "https://ask-tatiana.vercel.app/"
    },
    {
      "title": "Randomocity Studios",
      "description": "My personal website that acts as a resume and living portfolio. You are on this site right now! Recently upgraded from .Net Core 2.1 to .Net 6.0!",
      "tech": "C#, .NET Core, JavaScript, JQuery, HTML, CSS, Bootstrap",
      "imagepath": "/images/projects/randomocity_studios.jpg",
      "source": "https://github.com/wesleyvankomen/RandomocityStudios",
      "url": ""
    },
    {
      "title": "Monte Carlo Simulator",
      "description": "A windows application that uses the Monte Carlo method for experimentally calculating the value of pi. Different experiment parameters can be used to see how this affects the approximation result.",
      "tech": "C#, .NET Framework, WPF",
      "imagepath": "/images/projects/monte_carlo_simulator_2.jpg",
      "source": "https://github.com/wesleyvankomen/MonteCarloSimulator",
      "url": ""
    },
    {
      "title": "Turtle Memory Game",
      "description": "A memory game where colored turtles light up in a randomly ordered pattern, then the player must click the turtles in the same order as the original pattern. The game has 20 levels, which get progressively faster as more steps are added to the pattern. I built this game in a weekend after being inspired by a very simple JavaScript based simon game I had found on CodePen.",
      "tech": "JavaScript, JQuery, HTML, CSS",
      "imagepath": "/images/projects/turtle_memory_game.jpg",
      "source": "https://github.com/wesleyvankomen/TurtleMemoryGame",
      "url": "https://wesleyvankomen.github.io/TurtleMemoryGame/"
    },
    {
      "title": "WWU CBE Calculator",
      "description": "A chrome extension for calculating the GPAs of students in the College of Business of Economics based on specific set of classes. This was part of my senior project at WWU, and I acted as the team lead for phase 2 development, having three other students on my development team. Our team provided several bug fixes, added user-friendly printer support, updated the grade replacement rules specific based on CBE policy change, and wrote a suite of unit tests to help ensure correctness.",
      "tech": "JavaScript, Angular, HTML, CSS, X-Editable",
      "imagepath": "/images/projects/wwu_cbe_calculator.jpg",
      "source": "https://github.com/wesleyvankomen/cbe-calc",
      "url": "https://chrome.google.com/webstore/detail/wwu-cbe-gpa-calculator/lkapdoedojaackmiippolfcncadkfebd?hl=en"
    }
  ]
}
